bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications (适配UDP传入×10角度值)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os2.h"
#include "stm32f407xx.h"
#include "stm32f4xx_hal.h"
#include "main.h"
#include "lwip/netif.h"
#include "lwip/udp.h"
#include "lwip/inet.h"
#include "string.h"
#include "tim.h"
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>
#include "usart.h"
#include "lwip.h"
#include "err.h"
#include "logger.h"
#include "thread_manager.h"
#include "queue.h"
#include "ext_dev_ctrl.h"  // 添加外部设备控制头文件

// -------------------------- 全局变量 --------------------------
uint16_t Motor_Angle     = 0;       // 当前角度
uint16_t Target_Angle    = 0;       // 目标角度
uint16_t Motor_Length    = 0;       // 当前送料长度
uint16_t Target_Length   = 0;       // 目标送料长度
uint8_t  Motor_DIR       = 0;       // 电机方向变量（1=顺时针，2=逆时针）
uint8_t  Feeding_DIR     = 0;       // 送料方向变量（1=顺时针，2=逆时针）
static uint8_t Motor_Sys_St = 0;    // 电机运行状态
static uint8_t Feeding_Sys_St = 0;  // 送料运行状态

// -------------------------- 消息队列+中途停止核心定义 --------------------------

volatile uint8_t g_motor_force_stop_flag = 0;
volatile uint8_t g_feeding_force_stop_flag = 0;
QueueHandle_t g_motor_action_queue = NULL;
QueueHandle_t g_feeding_action_queue = NULL;

#define QUEUE_LENGTH    10                    // 队列长度：最多缓存10条指令
#define QUEUE_ITEM_SIZE sizeof(ActionMsg_t)   // 单个消息的字节数

// -------------------------- UDP相关宏定义 --------------------------
#define UDP_MAX_SEND_LEN       1472           // UDP最大发送长度（MTU-28）
#define UDP_RECV_BUF_LEN       10             // 指令帧长度（10字节有效）
#define UDP_FRAME_HEADER       0x55           // 帧头（Byte0）
#define UDP_FRAME_Read         0x02           // Byte1 = 0x03:读取数据指令
#define UDP_FRAME_Motor        0x03           // Byte1 = 0x02:电机控制指令
#define UDP_FRAME_Feeding      0x04           // Byte1 = 0x04:送料控制指令
#define UDP_FRAME_Cut          0x05           // Byte1 = 0x05:裁断控制指令
#define UDP_FRAME_Saw          0x06           // Byte1 = 0x06:圆锯控制指令
#define UDP_FRAME_TSJ          0x07           // Byte1 = 0x07:套丝控制指令
#define UDP_FRAME_Clamp        0x08           // Byte1 = 0x08:加紧控制指令
#define UDP_FRAME_Free         0x09           // Byte1 = 0x09:放松控制指令
#define UDP_CHECK_BYTE_INDEX   9              // 和校验字节位置（Byte9）
#define UDP_FRAME_VALID_LEN    10             // 有效帧长度（Byte0~Byte9）
#define UDP_LOCAL_PORT_T       8080           // 本地发送端口
#define UDP_LOCAL_PORT_R       8041           // 本地UDP接收端口
#define ENCODER_MAX_ANGLE      3600           // 电机编码器最大角度（×10值）
#define UDP_RESP_OK            0x01           // 响应成功
#define UDP_RESP_ERR           0x02           // 响应失败
#define UDP_RESP_EXIST         0x03           // 响应已存在

// -------------------------- UDP全局变量 --------------------------
static struct udp_pcb *udp_pcb_T = NULL;      // 发送任务UDP控制块
static struct udp_pcb *udp_pcb_R = NULL;      // 接收任务UDP控制块
extern ip4_addr_t dest_ipaddr;                // 目标IP（main.c定义）
extern uint16_t dest_port;                    // 目标端口（main.c定义）
extern struct netif gnetif;                   // 网络接口（lwip.c定义）
static uint8_t udp_init_flag = 0;             // UDP初始化标记

// -------------------------- 函数声明 --------------------------
// 任务函数声明
void StartMotorTask(void *argument);
void StartETHTask(void *argument);
void StartGPIOMonitorTask(void *argument);
void StartFeedingTask(void *argument);
void UDP_LED_Flash_Task(void *arg);

// UDP核心函数声明
static err_t UDP_Send_Data(uint8_t *data, uint16_t len);
static void UDP_Recv_Callback(void *arg, struct udp_pcb *upcb, struct pbuf *p, const ip_addr_t *addr, u16_t port);
static int UDP_Init(void);

// 工具函数声明
static uint16_t Read_GPIO_State(void);  // 读取GPIO状态
uint32_t encoder_gray_read(void);       // 读取绝对值编码器
uint16_t NormalizeAngle(int32_t angle); // 标准化角度值

// 消息队列发送函数声明
BaseType_t SendMotorActionMsg(ActionType_t action_type, void *param);
BaseType_t SendFeedingActionMsg(ActionType_t action_type, void *param);
void SendMotorCtrlMsg(uint16_t target_angle, uint8_t motor_dir);
void SendFeedingCtrlMsg(uint32_t target_length,uint8_t direction);
void SendForceStopMsg(void);

// 外部声明
extern void MX_LWIP_Init(void);
extern TIM_HandleTypeDef htim3;
extern UART_HandleTypeDef huart1;
extern UART_HandleTypeDef huart3;

// 送料机控制指令
// 故障复位命令
static const uint8_t Reset[]     = {0x03,0x06,0x31,0x00,0x00,0x86,0x07,0x76};
// 使能命令
static const uint8_t Enable[]    = {0x03,0x06,0x31,0x00,0x00,0x0F,0xC6,0xD0};
// 非使能命令
static const uint8_t Disable[]   = {0x03,0x06,0x31,0x00,0x00,0x06,0x06,0xD6};
// 设置工作模式命令
static const uint8_t Mode_Set[]  = {0x03,0x06,0x35,0x00,0x00,0x03,0xC7,0xE5};
// 设置速度命令
static const uint8_t RPM_Set[]   = {0x03,0x10,0x6F,0x00,0x00,0x02,0x04,0x55,0x55,0x00,0x08,0x11,0xFF};
// 设置正向命令
static const uint8_t DIR_Set_CW[] = {0x03,0x06,0x47,0x00,0x00,0x01,0x5D,0x5C};
// 设置逆向命令
static const uint8_t DIR_Set_CCW[] = {0x03,0x06,0x47,0x00,0x00,0x00,0x9C,0x9C};

// -------------------------- FreeRTOS初始化 --------------------------
void MX_FREERTOS_Init(void) {
    // 1. 初始化日志系统
    logger_init();
    LOG_INFO("MX_FREERTOS_Init: System start successfully");
    
    // 2. 创建电机控制消息队列
    g_motor_action_queue = xQueueCreate(QUEUE_LENGTH, QUEUE_ITEM_SIZE);
    if(g_motor_action_queue == NULL) {
        LOG_ERROR("MX_FREERTOS_Init: Create Motor action queue failed");
        return;
    }
    LOG_INFO("MX_FREERTOS_Init: Motor action queue created successfully");
    // 3. 创建送料控制消息队列
    g_feeding_action_queue = xQueueCreate(QUEUE_LENGTH, QUEUE_ITEM_SIZE);
    if(g_feeding_action_queue == NULL) {
        LOG_ERROR("MX_FREERTOS_Init: Create Feeding action queue failed");
        return;
    }
    LOG_INFO("MX_FREERTOS_Init: Feeding action queue created successfully");
    
