bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
    // 3. 初始化线程管理器
    thread_manager_init();
    LOG_INFO("MX_FREERTOS_Init: Thread manager initialized");
    
    // 4. 发送任务创建指令
    thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_ETH, 0, 0, NULL);
    thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_GPIO_MONITOR, 0, 0, NULL);
    thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_MOTOR, 0, 0, NULL);
    thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_Feeding, 0, 0, NULL);
    
    LOG_INFO("MX_FREERTOS_Init: Task create commands sent to thread manager");
    // thread_manager_print_tasklist();
}

// -------------------------- 消息队列发送函数 --------------------------
BaseType_t SendMotorActionMsg(ActionType_t action_type, void *param) {
    if(g_motor_action_queue == NULL || param == NULL) {
        LOG_ERROR("SendMotorActionMsg: Queue is NULL or param is NULL");
        return pdFAIL;
    }

    ActionMsg_t send_msg = {0};
    send_msg.action_type = action_type;

    // 根据动作类型拷贝参数
    switch(action_type) {
        case ACTION_MOTOR_CTRL: {
            memcpy(&send_msg.params.motor_params, param, sizeof(send_msg.params.motor_params));
            break;
        }
        case ACTION_MOTOR_FORCE_STOP:
        case ACTION_SYSTEM_STOP: {
            memcpy(&send_msg.params.stop_params, param, sizeof(send_msg.params.stop_params));
            break;
        }
        default: {
            LOG_WARN("SendMotorActionMsg: Invalid action type: %d", action_type);
            return pdFAIL;
        }
    }

    // 非阻塞发送
    BaseType_t xStatus = xQueueSend(g_motor_action_queue, &send_msg, 0);
    
    if(xStatus == pdPASS) {
        LOG_DEBUG("SendMotorActionMsg: Send %d action success", action_type);
    } else {
        LOG_ERROR("SendMotorActionMsg: Send %d action failed (queue full?)", action_type);
    }

    return xStatus;
}
BaseType_t SendFeedingActionMsg(ActionType_t action_type, void *param) {
    if(g_feeding_action_queue == NULL || param == NULL) {
        LOG_ERROR("SendFeedingActionMsg: Queue is NULL or param is NULL");
        return pdFAIL;
    }

    ActionMsg_t send_msg = {0};
    send_msg.action_type = action_type;

    // 根据动作类型拷贝参数
    switch(action_type) {
        case ACTION_FEEDING_CTRL: {
            memcpy(&send_msg.params.feeding_params, param, sizeof(send_msg.params.feeding_params));
            break;
        }
        case ACTION_FEEDING_FORCE_STOP:
        case ACTION_SYSTEM_STOP: {
            memcpy(&send_msg.params.stop_params, param, sizeof(send_msg.params.stop_params));
            break;
        }
        default: {
            LOG_WARN("SendFeedingActionMsg: Invalid action type: %d", action_type);
            return pdFAIL;
        }
    }

    // 非阻塞发送
    BaseType_t xStatus = xQueueSend(g_feeding_action_queue, &send_msg, 0);
    
    if(xStatus == pdPASS) {
        LOG_DEBUG("SendFeedingActionMsg: Send %d action success", action_type);
    } else {
        LOG_ERROR("SendFeedingActionMsg: Send %d action failed (queue full?)", action_type);
    }

    return xStatus;
}
void SendMotorCtrlMsg(uint16_t target_angle, uint8_t motor_dir) {
    // 转发到线程管理器
    thread_manager_send_cmd(THREAD_OP_MOTOR_CTRL, THREAD_TYPE_MOTOR, target_angle, motor_dir, NULL);
}
void SendFeedingCtrlMsg(uint32_t target_length,uint8_t direction) {
    feed_direction_t validated_dir;
    
    // 验证方向值是否在有效范围内
    if(direction == FEED_DIR_FORWARD) {
        validated_dir = FEED_DIR_FORWARD;
    } else if(direction == FEED_DIR_BACKWARD) {
        validated_dir = FEED_DIR_BACKWARD;
    } else if(direction == FEED_DIR_STOP || direction == 0) {
        validated_dir = FEED_DIR_STOP;
    } else {
        LOG_ERROR("Invalid feed direction: %d", direction);
        return;  // 或其他错误处理
    }    
    // 转发到线程管理器
    thread_manager_send_cmd(THREAD_OP_FEEDING_CTRL, THREAD_TYPE_Feeding, target_length, validated_dir, NULL);
}
void SendForceStopMsg(void) {
    // 转发到线程管理器
    thread_manager_send_cmd(THREAD_OP_MOTOR_FORCE_STOP, THREAD_TYPE_MOTOR, 0, 0, NULL);
    thread_manager_send_cmd(THREAD_OP_FEEDING_FORCE_STOP, THREAD_TYPE_Feeding, 0, 0, NULL);
}

// -------------------------- GPIO状态读取 --------------------------
typedef struct {
    GPIO_TypeDef *gpio_port;  // GPIO端口
    uint16_t      gpio_pin;   // GPIO引脚
    uint16_t      bit_pos;    // 映射到gpio_state的位位置
} GPIO_State_Map_t;

static const GPIO_State_Map_t gpio_state_map[] = {
    {GPIOE, GPIO_PIN_4,    0},  // bit0: PE4
    {GPIOC, GPIO_PIN_13,   1},  // bit1: PC13
    {GPIOF, GPIO_PIN_0,    2},  // bit2: PF0
    {GPIOF, GPIO_PIN_1,    3},  // bit3: PF1
    {GPIOF, GPIO_PIN_2,    4},  // bit4: PF2
    {GPIOF, GPIO_PIN_9,    5},  // bit5: PF9
};

static uint16_t Read_GPIO_State(void) {
    uint16_t gpio_state = 0;
    uint8_t map_len = sizeof(gpio_state_map) / sizeof(GPIO_State_Map_t);

    // 遍历映射表，原子性读取所有GPIO状态
    for (uint8_t i = 0; i < map_len; i++) {
        if (HAL_GPIO_ReadPin(gpio_state_map[i].gpio_port, gpio_state_map[i].gpio_pin) != GPIO_PIN_SET) {
            gpio_state |= (1 << gpio_state_map[i].bit_pos);
        }
    }
    return gpio_state;
}

// -------------------------- 格雷码绝对值编码器读取函数 --------------------------
#define GRAY_10BIT_MAX   1023U   // 10bit格雷码最大值
#define ANGLE_MAX        3600    // 最大角度360,10倍转为整形（0.1精度）
uint32_t encoder_gray_read(void)
{
    uint16_t gray = 0;
    // G0~G9 对应GPIO，!取反适配NPN集电极开路输出
    gray |= !HAL_GPIO_ReadPin(GPIOF, GPIO_PIN_10)   << 0;   // G0
    gray |= !HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0)    << 1;   // G1
    gray |= !HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_2)    << 2;   // G2
    gray |= !HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_3)    << 3;   // G3
    gray |= !HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0)    << 4;   // G4
    gray |= !HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_3)    << 5;   // G5
    gray |= !HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6)    << 6;   // G6
    gray |= !HAL_GPIO_ReadPin(GPIOF, GPIO_PIN_11)   << 7;   // G7
    gray |= !HAL_GPIO_ReadPin(GPIOF, GPIO_PIN_12)   << 8;   // G8
    gray |= !HAL_GPIO_ReadPin(GPIOF, GPIO_PIN_13)   << 9;   // G9

    gray = gray & 0x3FF;  // 仅保留低10位
    uint16_t binary = gray;
    uint16_t mask = gray;
    
    // 格雷码转二进制（标准算法）
    while (mask) {
        mask >>= 1;
        binary ^= mask;
    }
    binary = binary & 0x3FF;
    
    // 10位格雷码（0~1023）→ 角度（0~3600）的线性映射
    uint32_t Angle = (uint32_t)binary * ANGLE_MAX / GRAY_10BIT_MAX;
    
    // 调试日志：打印格雷码→二进制→角度的转换过程
    // LOG_DEBUG("Gray:0x%03X, Bin:0x%03X, Angle: %d", gray, binary, Angle);
    return Angle;
}

