bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
// -------------------------- 角度归一化 --------------------------
uint16_t NormalizeAngle(int32_t angle) {
    // 确保角度在0~3599范围内循环（3600=360）
    angle = angle % 3600;
    if (angle < 0) {
        angle += 3600;
    }
    return (uint16_t)angle;
}

// -------------------------- UDP LED闪烁任务--------------------------
void UDP_LED_Flash_Task(void *arg) {
    uint8_t UDP_LED_FLASH_CNT = 5;          // UDP初始化成功后LED闪烁次数
    #define UDP_LED_FLASH_DELAY 200         // LED闪烁间隔（ms）
    
    LOG_INFO("UDP_LED_Flash_Task: Start flashing LED");
    for (int i = 0; i < UDP_LED_FLASH_CNT; i++) {
        HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_3);
        osDelay(UDP_LED_FLASH_DELAY);
    }
    HAL_GPIO_WritePin(GPIOG, GPIO_PIN_3, GPIO_PIN_RESET);
    
    // 通过线程管理器删除自身任务
    thread_manager_send_cmd(THREAD_OP_DELETE, THREAD_TYPE_UDP_LED, 0, 0, NULL);
    LOG_INFO("UDP_LED_Flash_Task: Flash completed, task deleted");
    
    osThreadExit();
}

// -------------------------- UDP发送函数 --------------------------
static err_t UDP_Send_Data(uint8_t *data, uint16_t len) {
    err_t err = ERR_OK;

    // 1. 严格参数校验
    if (udp_pcb_T == NULL || data == NULL || len == 0 || 
        len > UDP_MAX_SEND_LEN || len > UDP_FRAME_VALID_LEN) {
        LOG_ERROR("UDP_Send_Data: Invalid param (pcb=%p, len=%d)", udp_pcb_T, len);
        return ERR_ARG;
    }

    // 2. 校验网络状态
    if (!netif_is_up(&gnetif) || !netif_is_link_up(&gnetif)) {
        LOG_ERROR("UDP_Send_Data: Netif DOWN (up=%d, link=%d)", netif_is_up(&gnetif), netif_is_link_up(&gnetif));
        return ERR_RTE;
    }

    // 3. 校验UDP PCB状态（LWIP 2.x兼容）
    #if LWIP_VERSION_MAJOR >= 2
    if (udp_pcb_T->state == UDP_STATE_CLOSED) {
        LOG_ERROR("UDP_Send_Data: UDP PCB Closed");
        return ERR_CONN;
    }
    #endif
    if (udp_pcb_T->local_port == 0) {
        LOG_ERROR("UDP_Send_Data: UDP PCB Unbound");
        return ERR_CONN;
    }

    // 4. 校验目标IP/端口合法性
    if (dest_ipaddr.addr == PP_HTONL(0x00000000)) {
        LOG_ERROR("UDP_Send_Data: Dest IP is 0.0.0.0");
        return ERR_ARG;
    }
    if (dest_port == 0 || dest_port > 65535) {
        LOG_ERROR("UDP_Send_Data: Dest Port invalid (%d)", dest_port);
        return ERR_ARG;
    }

    // 5. 分配pbuf缓冲区
    struct pbuf *p = pbuf_alloc(PBUF_TRANSPORT, len, PBUF_RAM);
    if (p == NULL) {
        LOG_ERROR("UDP_Send_Data: PBUF Alloc Fail");
        return ERR_MEM;
    }

    // 6. 安全拷贝数据
    if (pbuf_take(p, data, len) != ERR_OK) {
        LOG_ERROR("UDP_Send_Data: PBUF Copy Fail");
        pbuf_free(p);
        return ERR_BUF;
    }

    // 7. 发送UDP数据
    err = udp_sendto(udp_pcb_T, p, &dest_ipaddr, dest_port);
    
    // 8. 错误码解析
    switch (err) {
        case ERR_OK:
            LOG_DEBUG("UDP_Send_Data: Send OK (len=%d, dest=%s:%d)", len, ip4addr_ntoa(&dest_ipaddr), dest_port);
            break;
        case ERR_RTE:
            LOG_ERROR("UDP_Send_Data: No Route to dest");
            break;
        case ERR_CONN:
            LOG_ERROR("UDP_Send_Data: Port Closed");
            break;
        case ERR_MEM:
            LOG_ERROR("UDP_Send_Data: Memory Full");
            break;
        case ERR_ARG:
            LOG_ERROR("UDP_Send_Data: Invalid Argument");
            break;
        default:
            LOG_ERROR("UDP_Send_Data: Unknown Error (%d)", err);
            break;
    }

    // 9. 释放pbuf
    pbuf_free(p);
    p = NULL;

    return err;
}

// -------------------------- UDP接收回调 --------------------------
static void UDP_Recv_Callback(void *arg, struct udp_pcb *upcb, struct pbuf *p, const ip_addr_t *addr, u16_t port) {
    // 空包检查
    if (p == NULL) {
        return;
    }
    
    // 1. 基础合法性校验
    if (p->tot_len < UDP_FRAME_VALID_LEN) {
        LOG_ERROR("UDP_Recv_Callback: Frame len too short (%d < %d)", p->tot_len, UDP_FRAME_VALID_LEN);
        pbuf_free(p);
        return;
    }
    if (addr == NULL || port == 0) {
        LOG_ERROR("UDP_Recv_Callback: Invalid addr/port");
        pbuf_free(p);
        return;
    }

    // 2. 安全拷贝数据到接收缓冲区
    uint8_t recv_buf[UDP_RECV_BUF_LEN] = {0};
    if (pbuf_copy_partial(p, recv_buf, UDP_FRAME_VALID_LEN, 0) != UDP_FRAME_VALID_LEN) {
        LOG_ERROR("UDP_Recv_Callback: Data Copy Fail");
        pbuf_free(p);
        return;
    }

    // 3. 帧头校验
    if (recv_buf[0] != UDP_FRAME_HEADER) {
        LOG_ERROR("UDP_Recv_Callback: Invalid header (0x%02X != 0x%02X)", recv_buf[0], UDP_FRAME_HEADER);
        pbuf_free(p);
        return;
    }

    // 4. 和校验
    uint8_t calc_check = 0;
    for (int i = 0; i < UDP_CHECK_BYTE_INDEX; i++) {
        calc_check += recv_buf[i];
    }
    if (calc_check != recv_buf[UDP_CHECK_BYTE_INDEX]) {
        LOG_ERROR("UDP_Recv_Callback: Checksum error (calc=0x%02X, recv=0x%02X)", calc_check, recv_buf[UDP_CHECK_BYTE_INDEX]);
        pbuf_free(p);
        return;
    }

    // 5. 指令处理
    if(recv_buf[1] == UDP_FRAME_Motor) { // 电机控制指令
        uint8_t dir = recv_buf[2];
        uint16_t Target_Angle_Parse = (uint16_t)((recv_buf[3] << 8) | recv_buf[4]);

        LOG_INFO("UDP_Recv_Callback: Motor cmd - dir = %d, target_angle = %d", 
                 dir, Target_Angle_Parse);

        uint8_t resp[2] = {0};
        resp[0] = UDP_FRAME_Motor; // 响应帧头

        // 如果指令是电机停止（dir=0）
        if(dir == 0) {
            SendForceStopMsg(); // 发送强制停止指令
            HAL_GPIO_WritePin(GPIOG, GPIO_PIN_5 | GPIO_PIN_6, GPIO_PIN_RESET);
            LOG_WARN("UDP_Recv_Callback: Motor Stop cmd received, send force stop msg");
            resp[1] = UDP_RESP_OK;
            UDP_Send_Data(resp, sizeof(resp));
            Motor_DIR = 0;
            Target_Angle = 0;
            Motor_Sys_St = 0;
            osDelay(10);
            pbuf_free(p);
            return;
        }

        // 指令是电机启动（dir=1/2）
        if(dir != 1 && dir != 2) {
            LOG_ERROR("UDP_Recv_Callback: Invalid dir (%d), only 1/2 allowed", dir);
            resp[1] = UDP_RESP_ERR;
            UDP_Send_Data(resp, sizeof(resp));
            pbuf_free(p);
            return;
        }
        if(Motor_Sys_St == 0){
            uint16_t target_angle = Target_Angle_Parse;
            if(target_angle > 3600) { // 最大3600（360）
                LOG_WARN("UDP_Recv_Callback: Target angle (%d) exceed max (3600), limit to 3600", 
                        target_angle);
                target_angle = 3600;
            }

            // 发送电机控制指令
            SendMotorCtrlMsg(target_angle, dir);
            
            // 确保电机任务存在
            osThreadId_t motor_handle = thread_manager_get_thread_handle(THREAD_TYPE_MOTOR);
            if (motor_handle == NULL) {
                thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_MOTOR, 0, 0, NULL);
                osDelay(10);
                motor_handle = thread_manager_get_thread_handle(THREAD_TYPE_MOTOR);
            }
            
            if(motor_handle != NULL) {
                resp[1] = UDP_RESP_OK;
                LOG_INFO("UDP_Recv_Callback: Motor cmd send to thread manager success");
            } else {
                resp[1] = UDP_RESP_ERR;
                LOG_ERROR("UDP_Recv_Callback: Motor task create failed");
            }
            UDP_Send_Data(resp, sizeof(resp));
        } else {
            resp[1] = UDP_RESP_EXIST; // 设备忙
            UDP_Send_Data(resp, sizeof(resp));
            LOG_WARN("UDP_Recv_Callback: Motor busy (Motor_Sys_St=1), reject cmd");
            pbuf_free(p);
            return;
        }
        
