bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
    }

    else if(recv_buf[1] == UDP_FRAME_Feeding) { // 送料控制指令
        uint8_t dir = recv_buf[2];
        uint16_t Target_Length_Parse = (uint16_t)((recv_buf[3] << 8) | recv_buf[4]);

        LOG_INFO("UDP_Recv_Callback: Feeding cmd - dir = %d, target_Length = %d", 
                 dir, Target_Length_Parse);

        uint8_t resp[2] = {0};
        resp[0] = UDP_FRAME_Feeding; // 响应帧头

        // 如果指令是停止（dir=0）
        if(dir == 0) {
            SendForceStopMsg(); // 发送强制停止指令
            LOG_WARN("UDP_Recv_Callback: Feeding Stop cmd received, send force stop msg");
            resp[1] = UDP_RESP_OK;
            UDP_Send_Data(resp, sizeof(resp));
            Feeding_DIR = 0;
            Target_Length = 0;
            Feeding_Sys_St = 0;
            osDelay(10);
            pbuf_free(p);
            return;
        }

        // 指令是电机启动（dir=1/2）
        if(dir != 1 && dir != 2) {
            LOG_ERROR("UDP_Recv_Callback: Invalid dir (%d), only 1/2 allowed", dir);
            resp[1] = UDP_RESP_ERR;
            UDP_Send_Data(resp, sizeof(resp));
            pbuf_free(p);
            return;
        }
        if(Feeding_Sys_St == 0) {
            // uint16_t Target_Length = Target_Length_Parse * 36000 / 13393;
            uint16_t Target_Length = Target_Length_Parse;
            // 发送送料控制指令
            SendFeedingCtrlMsg(Target_Length, dir);
            
            // 确保电机任务存在
            osThreadId_t Feeding_handle = thread_manager_get_thread_handle(THREAD_TYPE_Feeding);
            if (Feeding_handle == NULL) {
                thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_Feeding, 0, 0, NULL);
                osDelay(10);
                Feeding_handle = thread_manager_get_thread_handle(THREAD_TYPE_Feeding);
            }
            
            if(Feeding_handle != NULL) {
                resp[1] = UDP_RESP_OK;
                LOG_INFO("UDP_Recv_Callback: Feeding cmd send to thread manager success");
            } else {
                resp[1] = UDP_RESP_ERR;
                LOG_ERROR("UDP_Recv_Callback: Feeding task create failed");
            }
            UDP_Send_Data(resp, sizeof(resp));
        } else {
            resp[1] = UDP_RESP_EXIST; // 设备忙
            UDP_Send_Data(resp, sizeof(resp));
            LOG_WARN("UDP_Recv_Callback: Feeding busy (Feeding_Sys_St=1), reject cmd");
            pbuf_free(p);
            return;
        }
    }
    else if(recv_buf[1] == UDP_FRAME_TSJ) { // 套丝机指令
    // 仅转发指令到线程管理器，不直接调用函数
        thread_manager_send_cmd(THREAD_OP_TSJ_CTRL, THREAD_TYPE_NONE, 0, 0, NULL);
        // 发送响应
        uint8_t resp[] = {UDP_FRAME_TSJ, UDP_RESP_OK};
        UDP_Send_Data(resp, sizeof(resp));
    }
    else if(recv_buf[1] == UDP_FRAME_Saw) { // 圆锯指令
        thread_manager_send_cmd(THREAD_OP_SAW_CTRL, THREAD_TYPE_NONE, 0, 0, NULL);
        uint8_t resp[] = {UDP_FRAME_Saw, UDP_RESP_OK};
        UDP_Send_Data(resp, sizeof(resp));
    }
    else if(recv_buf[1] == UDP_FRAME_Cut) { // 裁断指令
        thread_manager_send_cmd(THREAD_OP_CUT_CTRL, THREAD_TYPE_NONE, 0, 0, NULL);
        uint8_t resp[] = {UDP_FRAME_Cut, UDP_RESP_OK};
        UDP_Send_Data(resp, sizeof(resp));
    }
    else if(recv_buf[1] == UDP_FRAME_Clamp) { // 夹紧指令
        thread_manager_send_cmd(THREAD_OP_CLMP_CTRL, THREAD_TYPE_NONE, 0, 0, NULL);
        uint8_t resp[] = {UDP_FRAME_Clamp, UDP_RESP_OK};
        UDP_Send_Data(resp, sizeof(resp));
    }
    else if(recv_buf[1] == UDP_FRAME_Free) { // 放松指令
        thread_manager_send_cmd(THREAD_OP_FREE_CTRL, THREAD_TYPE_NONE, 0, 0, NULL);
        uint8_t resp[] = {UDP_FRAME_Free, UDP_RESP_OK};
        UDP_Send_Data(resp, sizeof(resp));
    }
    // 读取状态指令
    else if(recv_buf[1] == UDP_FRAME_Read) { 
        // 组装响应包
        uint8_t send_buf[UDP_FRAME_VALID_LEN] = {0};
        uint16_t gpio_state = Read_GPIO_State();

        send_buf[0] = 0x33;                                 // 响应帧头
        send_buf[1] = UDP_FRAME_Read;                       // 响应指令类型
        send_buf[2] = (Motor_Sys_St || Feeding_Sys_St) ? 1 : 0; // 系统状态：0=待机，1=运行
        send_buf[3] = (uint8_t)(gpio_state & 0xFF);         // GPIO状态低8位
        send_buf[4] = (uint8_t)((gpio_state >> 8) & 0xFF);  // GPIO状态高8位

        // 计算校验和
        uint8_t send_check = 0;
        for (int i = 0; i < UDP_CHECK_BYTE_INDEX; i++) {
            send_check += send_buf[i];
        }
        send_buf[UDP_CHECK_BYTE_INDEX] = send_check;
        
        // 发送响应
        err_t send_err = UDP_Send_Data(send_buf, UDP_FRAME_VALID_LEN);
        if (send_err != ERR_OK) {
            LOG_ERROR("UDP_Recv_Callback: Send state fail (err=%d)", send_err);
        } else {
            LOG_DEBUG("UDP_Recv_Callback: Send state OK ");
        }
    }
    else { // 未知指令
        LOG_WARN("UDP_Recv_Callback: Unknown Command (0x%02X)", recv_buf[1]);
        uint8_t err_resp[] = "Error,Unknown Command";
        UDP_Send_Data(err_resp, sizeof(err_resp)-1);
    }

    // 释放pbuf
    pbuf_free(p);
    p = NULL;
}

// -------------------------- UDP初始化 --------------------------
static int UDP_Init(void) {
    // 防重复初始化
    if (udp_init_flag == 1) {
        LOG_INFO("UDP_Init: Already initialized");
        return 0;
    }

    // 校验LWIP核心是否初始化
    #if LWIP_VERSION_MAJOR >= 2
    if (!tcpip_initialized()) {
        LOG_ERROR("UDP_Init: LWIP Not Initialized");
        return -2;
    }
    #endif

    err_t err;
    ip_addr_t local_ip = IPADDR4_INIT_BYTES(0, 0, 0, 0);

    // 1. 初始化发送控制块
    udp_pcb_T = udp_new();
    if (udp_pcb_T == NULL) {
        LOG_ERROR("UDP_Init: Create send PCB fail");
        return -1;
    }

    // 绑定发送端口
    err = udp_bind(udp_pcb_T, &local_ip, UDP_LOCAL_PORT_T);
    if (err != ERR_OK) {
        LOG_ERROR("UDP_Init: Bind send port fail (err=%d)", err);
        udp_remove(udp_pcb_T);
        udp_pcb_T = NULL;
        return -3;
    }

    // 2. 初始化接收控制块
    udp_pcb_R = udp_new();
    if (udp_pcb_R == NULL) {
        LOG_ERROR("UDP_Init: Create recv PCB fail");
        udp_remove(udp_pcb_T);
        udp_pcb_T = NULL;
        return -4;
    }

    // 绑定接收端口
    err = udp_bind(udp_pcb_R, &local_ip, UDP_LOCAL_PORT_R);
    if (err != ERR_OK) {
        LOG_ERROR("UDP_Init: Bind recv port fail (err=%d)", err);
        udp_remove(udp_pcb_T);
        udp_remove(udp_pcb_R);
        udp_pcb_T = NULL;
        udp_pcb_R = NULL;
        return -5;
    }

