bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
    // 3. 注册接收回调
    udp_recv(udp_pcb_R, UDP_Recv_Callback, NULL);

    // 4. 标记初始化完成
    udp_init_flag = 1;
    LOG_INFO("UDP_Init: Success (send port=%d, recv port=%d)", UDP_LOCAL_PORT_T, UDP_LOCAL_PORT_R);
    
    // 5. 创建LED闪烁任务
    thread_manager_send_cmd(THREAD_OP_CREATE, THREAD_TYPE_UDP_LED, 0, 0, NULL);

    return 0;
}

// -------------------------- 电机控制任务（最终版） --------------------------
#define ANGLE_ERROR_THRESHOLD 20      // 角度误差阈值（±2）
void StartMotorTask(void *argument) {
    ActionMsg_t recv_msg;                 // FreeRTOS队列消息
    BaseType_t xStatus;                   // 队列操作状态
    uint16_t Current_Angle      = 0;      // 当前绝对角度
    uint16_t Start_Angle        = 0;      // 任务启动时的初始角度
    int16_t  Target_Angle_      = 0;      // 目标绝对角度
    uint32_t Rotate_Increment   = 0;      // 旋转增量
    uint8_t  stop_flag          = 0;      // 停止标志
    uint32_t task_start_tick    = 0;      // 任务启动时间戳
    uint8_t  irq_saved          = 0;      // 中断状态保存

    LOG_INFO("StartMotorTask: Motor control task started (FreeRTOS queue)");
    
    for(;;) { // 常驻循环，监听FreeRTOS原生队列
        // 阻塞等待队列消息
        xStatus = xQueueReceive(g_motor_action_queue, &recv_msg, portMAX_DELAY);
        
        if(xStatus == pdPASS) {
            // 解析动作类型
            switch(recv_msg.action_type) {
                case ACTION_MOTOR_CTRL: {
                    // 重置停止标志和时间戳
                    g_motor_force_stop_flag = 0;
                    stop_flag = 0;
                    task_start_tick = osKernelGetTickCount();
                    
                    // 赋值电机参数
                    Target_Angle = recv_msg.params.motor_params.target_angle;
                    Motor_DIR = recv_msg.params.motor_params.motor_dir;
                    
                    LOG_INFO("StartMotorTask: Receive Motor CMD (target_angle = %d , dir = %d)",
                             Target_Angle, Motor_DIR);

                    // ========== 临界区保护 ==========
                    irq_saved = __get_PRIMASK();
                    __disable_irq();
                    Start_Angle = encoder_gray_read(); // 读取当前角度
                    __enable_irq();
                    if(Start_Angle == 0xFFFF) {
                        LOG_ERROR("StartMotorTask: Encoder read failed!");
                        stop_flag = 1;
                        goto motor_cleanup;
                    }
                    Rotate_Increment = Target_Angle; 
                    if(Rotate_Increment > 3600) {
                        LOG_WARN("StartMotorTask: Increment too large, limit to 3600");
                        Rotate_Increment = 3600;
                    }

                    Motor_Sys_St = 1; // 标记系统运行中

                    // 设置电机方向 + 计算目标角度（核心逻辑）
                    if(Motor_DIR == 1) { // 顺时针（正传）：当前角度 + 增量
                        Target_Angle_ = NormalizeAngle((int32_t)Start_Angle + Rotate_Increment);
                        HAL_GPIO_WritePin(GPIOG, GPIO_PIN_5, GPIO_PIN_RESET);
                        HAL_GPIO_WritePin(GPIOG, GPIO_PIN_6, GPIO_PIN_SET);
                        LOG_INFO("Rotate clockwise : %d / %d / %d ", 
                                 Start_Angle, Target_Angle_, Rotate_Increment);
                    } else if(Motor_DIR == 2) { // 逆时针（反转）：当前角度 - 增量
                        Target_Angle_ = NormalizeAngle((int32_t)Start_Angle - Rotate_Increment);
                        HAL_GPIO_WritePin(GPIOG, GPIO_PIN_5, GPIO_PIN_SET);
                        HAL_GPIO_WritePin(GPIOG, GPIO_PIN_6, GPIO_PIN_RESET);
                        LOG_INFO("Rotate counterclockwise : %d / %d / %d ", 
                                 Start_Angle, Target_Angle_, Rotate_Increment);
                    } else {
                        LOG_WARN("StartMotorTask: Invalid dir, stop motor");
                        stop_flag = 1;
                        goto motor_cleanup;
                    }

                    // ========== 闭环控制主循环 ==========
                    while(!stop_flag) {
                        __enable_irq();
                        // osDelay(5);
                        // 检测中途停止标志
                        if(g_motor_force_stop_flag == 1) {
                            LOG_INFO("StartMotorTask: Force stop detected! Stop motor immediately");
                            g_motor_force_stop_flag = 0;
                            stop_flag = 1;
                            break;
                        }

                        // 读取当前角度
                        Current_Angle = encoder_gray_read();
                        if(Current_Angle == 0xFFFF) {
                            LOG_ERROR("StartMotorTask: Encoder read failed in loop!");
                            stop_flag = 1;
                            break;
                        }

                        // 计算角度差（绝对值）
                        uint16_t Angle_D = abs((int32_t)Target_Angle_ - (int32_t)Current_Angle);
                        // 处理360循环的最小角度差（如350和10的差是20，不是340）
                        if (Angle_D > 1800) {
                            Angle_D = 3600 - Angle_D;
                        }

                        // 调试日志（每100ms打印一次）
                        if((osKernelGetTickCount() - task_start_tick) % 100 == 0) {
                            LOG_DEBUG("StartMotorTask: Current = %d , Target = %d , Error = %d",
                                     Current_Angle, Target_Angle_, Angle_D);
                        }

                        // 达到目标角度停止
                        if(Angle_D <= ANGLE_ERROR_THRESHOLD) {
                            LOG_INFO("StartMotorTask: Reach target (error = %d ≤ %d)",
                                     Angle_D, ANGLE_ERROR_THRESHOLD);
                            stop_flag = 1;
                            break;
                        }

                        osDelay(20); // 20ms延时

                        // 超时防护（10秒）
                        if(osKernelGetTickCount() - task_start_tick > pdMS_TO_TICKS(10000)) {
                            LOG_ERROR("StartMotorTask: Timeout (10s), force stop!");
                            stop_flag = 1;
                            break;
                        }
                    }

                    // ========== 电机停机+资源清理 ==========
                motor_cleanup:
                    if(irq_saved != 0) { // 原状态是关中断，才需要恢复
                        __enable_irq();
                    }
                    
