bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
                    // 停止电机
                    HAL_GPIO_WritePin(GPIOG, GPIO_PIN_5 | GPIO_PIN_6, GPIO_PIN_RESET);
                    
                    // 重置状态
                    Motor_Sys_St = 0;
                    Motor_DIR = 0;
                    Target_Angle = 0;
                    LOG_INFO("StartMotorTask: Motor stopped, cleanup done");
                    break;
                }
                case ACTION_MOTOR_FORCE_STOP: {
                    // 收到强制停止指令，置位标志
                    LOG_INFO("StartMotorTask: Receive force stop cmd from queue");
                    g_motor_force_stop_flag = 1;
                    break;
                }
                default: {
                    LOG_WARN("StartMotorTask: Receive invalid action type: %d", recv_msg.action_type);
                    break;
                }
            }
        } else {
            LOG_WARN("StartMotorTask: Read queue failed (status = %d)", xStatus);
        }
    }

    // 容错退出
    LOG_ERROR("StartMotorTask: Unexpected exit");
    thread_manager_send_cmd(THREAD_OP_DELETE, THREAD_TYPE_MOTOR, 0, 0, NULL);
    osThreadExit();
}

// -------------------------- GPIO监控任务 --------------------------
void StartGPIOMonitorTask(void *argument) {
    uint16_t gpio_state = 0;
    uint16_t last_gpio_state = 0;
    uint16_t gpio_debounce_buf[3] = {0}; // 防抖缓存

    LOG_INFO("StartGPIOMonitorTask: Started");
    for(;;) {
        // 1. 防抖处理
        gpio_debounce_buf[0] = gpio_debounce_buf[1];
        gpio_debounce_buf[1] = gpio_debounce_buf[2];
        gpio_debounce_buf[2] = Read_GPIO_State();
        // gpio_state = Read_GPIO_State();
        // LOG_DEBUG("GPIO_State: %d",gpio_state);
        
        if((gpio_debounce_buf[0] == gpio_debounce_buf[1]) && 
           (gpio_debounce_buf[1] == gpio_debounce_buf[2])) {
            gpio_state = gpio_debounce_buf[2];
        } else {
            gpio_state = last_gpio_state;
        }
        
        // 2. 状态变化则发送UDP反馈
        if(gpio_state != last_gpio_state) {
            uint8_t feedback_buf[UDP_FRAME_VALID_LEN] = {0};
            uint32_t current_angle = encoder_gray_read(); // 读取当前角度（×10值）

            feedback_buf[0] = 0x33;                                 // 响应帧头
            feedback_buf[1] = UDP_FRAME_Read;                       // 响应指令类型
            feedback_buf[2] = (Motor_Sys_St || Feeding_Sys_St) ? 1 : 0; // 系统状态：0=待机，1=运行
            feedback_buf[3] = (uint8_t)(gpio_state & 0xFF);         // GPIO状态低8位
            feedback_buf[4] = (uint8_t)((gpio_state >> 8) & 0xFF);  // GPIO状态高8位

            // 计算校验和
            uint8_t check_sum = 0;
            for(int i = 0; i < UDP_CHECK_BYTE_INDEX; i++) {
                check_sum += feedback_buf[i];
            }
            feedback_buf[UDP_CHECK_BYTE_INDEX] = check_sum;
            
            // 发送反馈
            UDP_Send_Data(feedback_buf, UDP_FRAME_VALID_LEN);
            last_gpio_state = gpio_state;
            
            LOG_DEBUG("StartGPIOMonitorTask: GPIO state changed (0x%04X), current_angle=%d (raw=%d)", 
                     gpio_state, current_angle/10, current_angle);
        }
        
        osDelay(5); // 5ms检查一次
    }
}

// -------------------------- 以太网通信任务 --------------------------
#define NETIF_READY_TIMEOUT_MS 10000 // 网络就绪超时（10s）
#define NETIF_CHECK_INTERVAL_MS 200  // 网络检查间隔（200ms）
void StartETHTask(void *argument) {
    int udp_init_ret;
    uint32_t netif_wait_ticks = 0;
    uint8_t netif_ready_flag = 0;

    LOG_INFO("StartETHTask: Started, initializing LWIP");
    // 确保LWIP只初始化一次
    static uint8_t lwip_init_flag = 0;
    if(lwip_init_flag == 0) {
        MX_LWIP_Init();
        lwip_init_flag = 1;
        LOG_INFO("StartETHTask: LWIP initialized successfully");
    }

    // 2. 等待网络就绪
    LOG_INFO("StartETHTask: Waiting for network ready...");
    while (1) {
        if (netif_is_up(&gnetif) &&
            netif_is_link_up(&gnetif) &&
            !ip4_addr_isany(&gnetif.ip_addr)) {
            netif_ready_flag = 1;
            break;
        }

        netif_wait_ticks += NETIF_CHECK_INTERVAL_MS;
        if (netif_wait_ticks >= NETIF_READY_TIMEOUT_MS) {
            LOG_ERROR("StartETHTask: Network ready timeout (10s)");
            LOG_ERROR("StartETHTask: Netif state - up = %d, link = %d, IP = %s",
                        netif_is_up(&gnetif) ? 1 : 0,
                        netif_is_link_up(&gnetif) ? 1 : 0,
                        ip4addr_ntoa(&gnetif.ip_addr));
            break;
        }
        osDelay(NETIF_CHECK_INTERVAL_MS);
    }

    // 3. 网络就绪则初始化UDP
    if (netif_ready_flag) {
        LOG_INFO("StartETHTask: Network ready - IP = %s, MAC = %02X:%02X:%02X:%02X:%02X:%02X",
                    ip4addr_ntoa(&gnetif.ip_addr),
                    gnetif.hwaddr[0], gnetif.hwaddr[1], gnetif.hwaddr[2],
                    gnetif.hwaddr[3], gnetif.hwaddr[4], gnetif.hwaddr[5]);

        udp_init_ret = UDP_Init();
        if (udp_init_ret == 0) {
            LOG_INFO("StartETHTask: UDP init success");
        } else {
            LOG_ERROR("StartETHTask: UDP init fail (ret = %d)", udp_init_ret);
        }
    } else {
        LOG_ERROR("StartETHTask: Skip UDP init (network not ready)");
    }

    // 4. 网络维护主循环
    for (;;) {
        // 处理以太网接收数据
        ethernetif_input(&gnetif);
        // LWIP核心定时任务
        sys_check_timeouts();

        // 检测网络是否断开
        if (!netif_is_up(&gnetif) ||
            !netif_is_link_up(&gnetif) ||
            ip4_addr_isany(&gnetif.ip_addr)) {
            LOG_ERROR("StartETHTask: Network disconnected, trying to reconnect");
            // 尝试重启LWIP
            if(lwip_init_flag == 1) {
                netif_set_down(&gnetif);
                netif_set_up(&gnetif);
                LOG_INFO("StartETHTask: Netif restarted");
            }
        }
        
        osDelay(50); // 50ms维护一次
    }
}

static uint16_t T_Delay = 30;               // 发送间隔
#define FEED_CALC_FACTOR_NUMERATOR   36000  // 分子：360 * 100，保留2位小数精度
#define FEED_CALC_FACTOR_DENOMINATOR 13393  // 分母：PI * 36.3 * 1.175 * 100 的近似整数


uint32_t feed_calc_target_angle(uint32_t target_length_raw) {
    // 使用整数运算计算目标角度
    // 公式：target_angle = target_length_raw * 36000 / 13393
    // 这等价于：target_length_raw * 360 / (PI * 36.3 * 1.175)
    
