bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
    // 为防止溢出，检查输入值
    if (target_length_raw > UINT32_MAX / FEED_CALC_FACTOR_NUMERATOR) {
        LOG_ERROR("Target length too large, may cause overflow");
        return 0;
    }
    
    uint64_t temp_result = (uint64_t)target_length_raw * FEED_CALC_FACTOR_NUMERATOR;
    uint32_t target_angle = (uint32_t)(temp_result / FEED_CALC_FACTOR_DENOMINATOR);
    
    LOG_DEBUG("Feed calc: raw=%u, angle=%u", target_length_raw, target_angle);
    
    return target_angle;
}
uint16_t feed_get_encoder_count(void) {
    return __HAL_TIM_GET_COUNTER(&htim3);
}
void StartFeedingTask(void *argument) {
    ActionMsg_t recv_msg;               // 队列消息
    BaseType_t xStatus;                 // 队列操作状态
    uint16_t start_count        = 0;    // 开始时编码器计数值
    uint16_t current_count      = 0;    // 当前编码器计数值
    uint32_t target_length      = 0;    // 目标长度
    uint32_t target_angle       = 0;    // 目标角度
    int32_t angle_difference    = 0;    // 角度差值
    uint8_t stop_flag           = 0;    // 停止标志
    uint32_t task_start_tick    = 0;    // 任务启动时间戳
    feed_direction_t direction  = 0;    // 方向

    if((htim3.Instance->CR1 & TIM_CR1_CEN) == 0) {
        // 启动TIM3编码器模式计数（硬件配置已由CubeMX完成，仅需启动）
        if (HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL) != HAL_OK) {
            LOG_ERROR("StartFeedingTask: TIM3 encoder start failed!");
            // 初始化失败则退出任务
            osThreadExit();
        }
        __HAL_TIM_SET_COUNTER(&htim3, 0);
        LOG_INFO("StartFeedingTask: TIM3 encoder initialized and started");

    } else {
        LOG_DEBUG("StartFeedingTask: TIM3 encoder already running");
    }

    LOG_INFO("StartFeedingTask: Feeding control task started (FreeRTOS queue)");
    
    for(;;) {
        // 阻塞等待队列消息
        xStatus = xQueueReceive(g_feeding_action_queue, &recv_msg, portMAX_DELAY);
        
        if(xStatus == pdPASS) {
            // 解析动作类型
            switch(recv_msg.action_type) {
                case ACTION_FEEDING_CTRL: {
                    // 重置停止标志和时间戳
                    g_feeding_force_stop_flag = 0;
                    stop_flag = 0;
                    task_start_tick = osKernelGetTickCount();
                    __HAL_TIM_SET_COUNTER(&htim3, 0);

                    // 赋值送料参数
                    target_length = recv_msg.params.feeding_params.target_length;
                    direction = recv_msg.params.feeding_params.direction;
                    
                    LOG_INFO("StartFeedingTask: Receive Feeding CMD (target_length = %d , dir = %d)",
                             target_length, direction);

                    // 读取当前编码器值作为起始值
                    start_count = feed_get_encoder_count();
                    if(start_count == 0xFFFF) {
                        LOG_ERROR("StartFeedingTask: Encoder read failed!");
                        stop_flag = 1;
                        goto feeding_cleanup;
                    }

                    // 计算目标角度
                    target_angle = feed_calc_target_angle(target_length);
                    
                    Feeding_Sys_St = 1; // 标记系统运行中

                    // 初始化电机：复位、禁用、设置模式、设置速度
                    HAL_UART_Transmit(&huart3, Reset, sizeof(Reset), 100);
                    vTaskDelay(T_Delay);
                    HAL_UART_Transmit(&huart3, Disable, sizeof(Disable), 100);
                    vTaskDelay(T_Delay);
                    HAL_UART_Transmit(&huart3, Mode_Set, sizeof(Mode_Set), 100);
                    vTaskDelay(T_Delay);
                    HAL_UART_Transmit(&huart3, RPM_Set, sizeof(RPM_Set), 100);
                    vTaskDelay(T_Delay);

                    // 根据方向设置电机
                    switch(direction) {
                        case FEED_DIR_FORWARD: // 正向送料
                            HAL_UART_Transmit(&huart3, DIR_Set_CW, sizeof(DIR_Set_CW), 100);
                            vTaskDelay(T_Delay);
                            HAL_UART_Transmit(&huart3, Enable, sizeof(Enable), 100);
                            LOG_INFO("StartFeedingTask: Forward feeding, start_count = %d, target_angle = %d", 
                                     start_count, target_angle);
                            break;
                        case FEED_DIR_BACKWARD: // 反向送料
                            HAL_UART_Transmit(&huart3, DIR_Set_CCW, sizeof(DIR_Set_CCW), 100);
                            vTaskDelay(T_Delay);
                            HAL_UART_Transmit(&huart3, Enable, sizeof(Enable), 100);
                            LOG_INFO("StartFeedingTask: Backward feeding, start_count = %d, target_angle = %d", 
                                     start_count, target_angle);
                            break;
                        default:
                            LOG_ERROR("StartFeedingTask: Invalid feed direction: %d", direction);
                            stop_flag = 1;
                            goto feeding_cleanup;
                    }

                    // ========== 闭环控制主循环 ==========
                    while(!stop_flag) {
                        // 检测中途停止标志
                        if(g_feeding_force_stop_flag == 1) {
                            LOG_INFO("StartFeedingTask: Force stop detected! Stop Feeding immediately");
                            g_feeding_force_stop_flag = 0;
                            stop_flag = 1;
                            break;
                        }
                                                
                        // 检查是否达到目标
                        current_count = feed_get_encoder_count();
                        if(current_count == 0xFFFF) {
                            LOG_ERROR("StartFeedingTask: Encoder read failed in loop!");
                            stop_flag = 1;
                            break;
                        }
                        // 计算当前角度差 - 使用强制类型转换为有符号整型，自动处理溢出问题
                        int32_t angle_difference = (int16_t)(current_count - start_count);

                        // 计数值→长度→角度（和送料指令的转换逻辑完全一致）
                        uint32_t current_length = (uint64_t)abs(angle_difference) * FEED_CALC_FACTOR_DENOMINATOR / FEED_CALC_FACTOR_NUMERATOR;
                        uint32_t current_angle = feed_calc_target_angle(current_length);
                        // // 计算当前角度差
                        // if (direction == FEED_DIR_FORWARD) {
                        //     // 正向：当前计数应该比开始计数大
                        //     if (current_count >= start_count) {
                        //         angle_difference = current_count - start_count;
                        //     } else {
                        //         // 处理计数器翻转情况（从65535到0）
                        //         angle_difference = (0xFFFF - start_count) + current_count + 1;
                        //     }
                        // } else {
                        //     // 反向：当前计数应该比开始计数小
                        //     if (current_count <= start_count) {
                        //         angle_difference = start_count - current_count;
                        //     } else {
                        //         // 处理计数器翻转情况（从0到65535）
                        //         angle_difference = (0xFFFF - current_count) + start_count + 1;
                        //     }
                        // }

