bingoscc/STM32F407ZGT6_FOR_Decice/Core/Src/freertos.c
                        // // 计数值→长度→角度（和送料指令的转换逻辑完全一致）
                        // uint32_t current_length = (uint64_t)abs(angle_difference) * FEED_CALC_FACTOR_DENOMINATOR / FEED_CALC_FACTOR_NUMERATOR;
                        // uint32_t current_angle = feed_calc_target_angle(current_length);

                        // 调试日志（每100ms打印一次）
                        if((osKernelGetTickCount() - task_start_tick) % 100 == 0) {
                            LOG_DEBUG("StartFeedingTask: Current angle = %d , Target = %d", 
                                     current_angle, target_angle);
                        }

                        // 达到目标长度停止
                        if (current_angle >= target_angle) {
                            LOG_INFO("StartFeedingTask: Reach target (current_angle = %d ≥ %d)",
                                     current_angle, target_angle);
                            stop_flag = 1;
                            break;
                        }

                        vTaskDelay(pdMS_TO_TICKS(20)); // 20ms延时

                        // 超时防护（10秒）
                        if(osKernelGetTickCount() - task_start_tick > pdMS_TO_TICKS(10000)) {
                            LOG_ERROR("StartFeedingTask: Timeout (10s), force stop!");
                            stop_flag = 1;
                            break;
                        }
                    }

                    // ========== 电机停机+资源清理 ==========
                feeding_cleanup:
                    // 停止电机
                    HAL_UART_Transmit(&huart3, Disable, sizeof(Disable), 100);
                    
                    // 重置状态
                    Feeding_Sys_St = 0;
                    Feeding_DIR = 0;
                    target_angle = 0;
                    LOG_INFO("StartFeedingTask: Feeding stopped, cleanup done");
                    break;
                }
                case ACTION_FEEDING_FORCE_STOP: {
                    // 收到强制停止指令，停止电机
                    LOG_INFO("StartFeedingTask: Receive force stop cmd from queue");
                    HAL_UART_Transmit(&huart3, Disable, sizeof(Disable), 100);
                    g_feeding_force_stop_flag = 1;
                    break;
                }
                case ACTION_SYSTEM_STOP: {
                    // 收到系统停止指令，退出任务
                    LOG_INFO("StartFeedingTask: Receive system stop cmd from queue");
                    HAL_UART_Transmit(&huart3, Disable, sizeof(Disable), 100);
                    vQueueDelete(g_feeding_action_queue);
                    g_feeding_action_queue = NULL;
                    osThreadExit();
                    break;
                }
                default: {
                    LOG_WARN("StartFeedingTask: Receive invalid action type: %d", recv_msg.action_type);
                    break;
                }
            }
        } else {
            LOG_WARN("StartFeedingTask: Read queue failed (status = %d)", xStatus);
        }
    }

    // 容错退出
    LOG_ERROR("StartFeedingTask: Unexpected exit");
    if(g_feeding_action_queue != NULL) {
        vQueueDelete(g_feeding_action_queue);
        g_feeding_action_queue = NULL;
    }
    osThreadExit();
}